# Create Project

In [1]:
#import libraries and SQL 
import pandas as pd
import numpy as np
import seaborn as sns
from scipy import stats

# import SQL materials
from sqlalchemy import create_engine
from sqlalchemy_utils import database_exists
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus as urlquote
from sqlalchemy_utils import create_database, database_exists

In [2]:
## Change username and password to match your personal MySQL Server settings
username = "root"
password = "Ahimsa81981182!"

movie = f'mysql+pymysql://{username}:{password}@localhost/movies'
engine = create_engine(movie)

In [4]:
# Check if the database exists. If not, create it.
if database_exists(movie) == False:
  create_database(movie)
else:
  print('The database already exists!')

The database already exists!

In [5]:
#load the data
tmbd=pd.read_csv('Data4_March31/tmdb_results_combined.csv.gz')
#check that the data loaded
tmbd.head(2)

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.5,22.0,NaN

In [6]:
tmbd.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2544 entries, 0 to 2543
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                2544 non-null   object
 1   adult                  2542 non-null   float64
 2   backdrop_path          1369 non-null   object
 3   belongs_to_collection  204 non-null    object
 4   budget                 2542 non-null   float64
 5   genres                 2542 non-null   object
 6   homepage               171 non-null    object
 7   id                     2542 non-null   float64
 8   original_language      2542 non-null   object
 9   original_title         2542 non-null   object
 10  overview               2492 non-null   object
 11  popularity             2542 non-null   float64
 12  poster_path            2284 non-null   object
 13  production_companies   2542 non-null   object
 14  production_countries   2542 non-null   object
 15  release_date           2525 non-null   object
 16  revenue                2542 non-null   float64
 17  runtime                2542 non-null   float64
 18  spoken_languages       2542 non-null   object
 19  status                 2542 non-null   object
 20  tagline                1088 non-null   object
 21  title                  2542 non-null   object
 22  video                  2542 non-null   float64
 23  vote_average           2542 non-null   float64
 24  vote_count             2542 non-null   float64
 25  certification          807 non-null    object
dtypes: float64(9), object(17)
memory usage: 516.9+ KB

In [8]:
# load the  cleaned data
basics = pd.read_csv('Data5/title_basics.csv.gz')
aka = pd.read_csv('Data5/title_aka.csv.gz')
rating = pd.read_csv('Data5/title_rating.csv.gz')

In [9]:
## create a col with a list of genres
basics['genres_split'] = basics['genres'].str.split(',')
basics

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama,[Drama]
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama,[Drama]
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,NaN,126,Drama,[Drama]
...,...,...,...,...,...,...,...,...,...,...
81486,tt9914942,movie,Life Without Sara Amat,La vida sense la Sara Amat,0,2019.0,NaN,74,Drama,[Drama]
81487,tt9915872,movie,The Last White Witch,My Girlfriend is a Wizard,0,2019.0,NaN,97,"Comedy,Drama,Fantasy","[Comedy, Drama, Fantasy]"
81488,tt9916170,movie,The Rehearsal,O Ensaio,0,2019.0,NaN,51,Drama,[Drama]
81489,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller","[Action, Adventure, Thriller]"
81490,tt9916362,movie,Coven,Akelarre,0,2020.0,NaN,92,"Drama,History","[Drama, History]"

In [10]:
#create a column
genres_split =basics['genres'].str.split(',')

unique_genres=genres_split.explode().unique()
unique_genres

array(['Comedy', 'Fantasy', 'Romance', 'Drama', 'Horror', 'Sci-Fi',
       'Biography', 'Mystery', 'Musical', 'Action', 'Adventure', 'Crime',
       'Thriller', 'Music', 'Animation', 'Family', 'History', 'War',
       'Sport', 'Western', 'Adult', 'Short', 'Reality-TV', 'News',
       'Talk-Show', 'Game-Show'], dtype=object)

In [11]:
exploded_genres = basics.explode('genres_split')
exploded_genres

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama,Drama
...,...,...,...,...,...,...,...,...,...,...
81489,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller",Action
81489,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller",Adventure
81489,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller",Thriller
81490,tt9916362,movie,Coven,Akelarre,0,2020.0,NaN,92,"Drama,History",Drama
81490,tt9916362,movie,Coven,Akelarre,0,2020.0,NaN,92,"Drama,History",History

In [12]:
#use unique to get the genres from the genres_split
unique_genres = sorted(exploded_genres['genres_split'].unique())

In [13]:
#create the genres_split column
title_genres = exploded_genres[['tconst', 'genres_split']].copy() 
title_genres.head(10)

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama
3  tt0088751       Comedy
3  tt0088751       Horror
3  tt0088751       Sci-Fi
4  tt0096056        Drama
5  tt0100275       Comedy

In [14]:
## Making the genre mapper dictionary
genre_id_map = dict(zip(unique_genres, range(len(unique_genres))))
genre_id_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [15]:
# create a new genre_id column using the map and drop string genres
title_genres['genre_id'] = title_genres['genres_split'].map(genre_id_map)

In [16]:
title_genres = title_genres.drop(columns='genres_split')

In [17]:
title_genres.head(2)

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9

In [19]:
#convert the genre dictionary into a dataframe
genre_lookup=pd.DataFrame({'Genre_name': genre_id_map.keys(),
                          'Genre_id': genre_id_map.values()})

In [20]:
#Save the MySQL with tconst as primary key
## Example
from sqlalchemy.types import *
## Calculate max string lengths for object columns
key_len = basics['tconst'].fillna('').map(len).max()
title_len = basics['primaryTitle'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'runtimeMinutes':Integer()}

In [21]:
print(df_schema)

{'tconst': String(length=11), 'primaryTitle': Text(length=243), 'startYear': Float(), 'runtimeMinutes': Integer()}

In [22]:
basics.head(2)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama,[Drama]

In [23]:
basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 81491 entries, 0 to 81490
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          81491 non-null  object
 1   titleType       81491 non-null  object
 2   primaryTitle    81491 non-null  object
 3   originalTitle   81491 non-null  object
 4   isAdult         81491 non-null  int64
 5   startYear       81491 non-null  float64
 6   endYear         0 non-null      float64
 7   runtimeMinutes  81491 non-null  int64
 8   genres          81491 non-null  object
 9   genres_split    81491 non-null  object
dtypes: float64(2), int64(2), object(6)
memory usage: 6.2+ MB

# Title Basics to SQL

In [24]:
#drop the unneeded columns
basics_cleaned = basics.drop(columns=['titleType','originalTitle', 'isAdult', 'genres','genres_split', 'endYear'])

In [25]:
# Save to sql with dtype and index=False
basics_cleaned.to_sql('basics',engine,dtype=df_schema,if_exists='replace',index=False)

81491

In [26]:
# add primary key
engine.execute('ALTER TABLE basics ADD PRIMARY KEY (`tconst`);')

# Title ratings to SQL

In [27]:
#check the columns
rating.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1300226 entries, 0 to 1300225
Data columns (total 3 columns):
 #   Column         Non-Null Count    Dtype
---  ------         --------------    -----
 0   tconst         1300226 non-null  object
 1   averageRating  1300226 non-null  float64
 2   numVotes       1300226 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 29.8+ MB

In [28]:
#create schema
rating_schema = {'tconst':String(key_len+1), 
                 'averageRating':Float(),
                 'numVotes':Integer()}#get_schema(ratings)

In [29]:
# Save to sql with dtype and index=False
rating.to_sql('ratings',engine,dtype=rating_schema,if_exists='replace',index=False)

1300226

In [30]:
# add primary key
engine.execute('ALTER TABLE ratings ADD PRIMARY KEY (`tconst`);')

# TMBD to SQL

In [48]:
tmbd.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2544 entries, 0 to 2543
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                2544 non-null   object
 1   adult                  2542 non-null   float64
 2   backdrop_path          1369 non-null   object
 3   belongs_to_collection  204 non-null    object
 4   budget                 2542 non-null   float64
 5   genres                 2542 non-null   object
 6   homepage               171 non-null    object
 7   id                     2542 non-null   float64
 8   original_language      2542 non-null   object
 9   original_title         2542 non-null   object
 10  overview               2492 non-null   object
 11  popularity             2542 non-null   float64
 12  poster_path            2284 non-null   object
 13  production_companies   2542 non-null   object
 14  production_countries   2542 non-null   object
 15  release_date           2525 non-null   object
 16  revenue                2542 non-null   float64
 17  runtime                2542 non-null   float64
 18  spoken_languages       2542 non-null   object
 19  status                 2542 non-null   object
 20  tagline                1088 non-null   object
 21  title                  2542 non-null   object
 22  video                  2542 non-null   float64
 23  vote_average           2542 non-null   float64
 24  vote_count             2542 non-null   float64
 25  certification          807 non-null    object
dtypes: float64(9), object(17)
memory usage: 516.9+ KB

In [49]:
#drop the unneeded columns
tmbd_cleaned =tmbd.drop(columns=['backdrop_path', 'adult','belongs_to_collection', 'homepage',
                         'original_language', 'original_title','overview', 'popularity',
                         'poster_path','production_companies', 'production_countries',
                         'release_date', 'runtime', 'spoken_languages','status',
                         'tagline', 'title', 'video','vote_average', 'vote_count'])

In [50]:
#check the columns
tmbd_cleaned.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2544 entries, 0 to 2543
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   imdb_id        2544 non-null   object
 1   budget         2542 non-null   float64
 2   genres         2542 non-null   object
 3   id             2542 non-null   float64
 4   revenue        2542 non-null   float64
 5   certification  807 non-null    object
dtypes: float64(3), object(3)
memory usage: 119.4+ KB

In [51]:
#drop the unneeded columns
tmbd_cleaned2 =tmbd_cleaned.drop(columns=['genres','id'])

In [52]:
## saving schema
key_len = tmbd_cleaned2['imdb_id'].map(len).max()
cert_len = tmbd_cleaned2['certification'].fillna('').map(len).max()


api_data_schema = {'imdb_id':String(key_len+1), 
                 'budget':Float(),
                   'revenue':Float(),
                 'certification':Text(cert_len+1),
                  }
api_data_schema

{'imdb_id': String(length=11),
 'budget': Float(),
 'revenue': Float(),
 'certification': Text(length=8)}

In [53]:
# Save to sql with dtype and index=False
tmbd_cleaned2.to_sql('tmbd_data',engine,dtype=api_data_schema,if_exists='replace',index=False)

2544

In [54]:
#add primary key
engine.execute('ALTER TABLE tmbd_data ADD PRIMARY KEY (`imdb_id`);')

IntegrityError: (pymysql.err.IntegrityError) (1062, "Duplicate entry '0' for key 'tmbd_data.PRIMARY'")
[SQL: ALTER TABLE tmbd_data ADD PRIMARY KEY (`imdb_id`);]
(Background on this error at: https://sqlalche.me/e/14/gkpj)

In [48]:
# Save to sql with dtype and index=False
genre_lookup.to_sql('genres',engine,if_exists='replace',index=False)

26

In [49]:
# Save to sql with dtype and index=False
title_genres.to_sql('title_genres',engine,if_exists='replace',index=False)

152476

# Show the first 5 lines

In [50]:
#check on the tables
q = '''SHOW TABLES;'''
pd.read_sql(q, engine)

  Tables_in_movies
0           basics
1           genres
2          ratings
3     title_genres
4        tmbd_data

In [51]:
#check on the tables
q = '''SELECT * FROM basics limit 5;'''
pd.read_sql(q, engine)

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0069049,The Other Side of the Wind,2018.0,122
3,tt0088751,The Naked Monster,2005.0,100
4,tt0096056,Crime and Punishment,2002.0,126

In [52]:
#check on the tables
q = '''SELECT * FROM ratings limit 5;'''
pd.read_sql(q, engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1967
1  tt0000002            5.8       263
2  tt0000003            6.5      1803
3  tt0000004            5.6       179
4  tt0000005            6.2      2603

In [53]:
#check on the tables
q = '''SELECT * FROM title_genres limit 5;'''
pd.read_sql(q, engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0069049         7

In [54]:
#check on the tables
q = '''SELECT * FROM tmbd_data limit 5;'''
pd.read_sql(q, engine)

     imdb_id      budget     revenue certification
0          0         NaN         NaN          None
1  tt0113026  10000000.0         0.0          None
2  tt0113092         0.0         0.0          None
3  tt0116391         0.0         0.0          None
4  tt0118694    150000.0  12854953.0            PG

In [55]:
#check on the tables
q = '''SELECT * FROM genres limit 5;'''
pd.read_sql(q, engine)

  Genre_name  Genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4